[
    {
        "title": "Handwritten Text Recognition: A Survey",
        "authors": "Carlos Garrido-Munoz, Antonio Rios-Vila, Jorge Calvo-Zaragoza",
        "description": "A comprehensive survey on Handwritten Text Recognition, covering recent advances, challenges, and future directions in the field.",
        "venue": "Submitted to Transactions on Pattern Analysis and Machine Intelligence (TPAMI)",
        "filename": "HTR-Survey.pdf",
        "code": "",
        "year": 2025
    },
    {
        "title": "On the Generalization of Handwritten Text Recognition Models",
        "authors": "Carlos Garrido-Munoz, Jorge Calvo-Zaragoza",
        "description": "Study on the generalization capabilities of Handwritten Text Recognition models, analyzing their performance across different domains and datasets.",
        "venue": "Accepted at Computer Vision and Pattern Recognition (CVPR) 2025 (Nashville, USA)",
        "filename": "assets/papers/cvpr_2025.pdf",
        "code": "https://github.com/carlos10garrido/HTR-OOD",
        "year": 2025
    },
    {
        "title": "Spatial context-based self-supervised learning for handwritten text recognition",
        "authors": "Carlos Penarrubia, Carlos Garrido-Munoz, Jose J. Valero-Mas, Jorge Calvo-Zaragoza",
        "description": "Novel approach using spatial context-based self-supervised learning techniques for improving handwritten text recognition performance.",
        "venue": "Accepted at Pattern Recognition Letters (PRL), 2025",
        "filename": "HTR-SSL.pdf",
        "code": "",
        "year": 2024
    },
    {
        "title": "Efficient Notation Assembly in Optical Music Recognition",
        "authors": "Carlos Peñarrubia, Carlos Garrido-Munoz, Jose J. Valero-Mas, Jorge Calvo-Zaragoza",
        "description": "Research on efficient methods for assembling musical notation in Optical Music Recognition systems.",
        "venue": "ISMIR 2023 (182-189)",
        "filename": "OMR-Assembly.pdf",
        "code": "",
        "year": 2023
    },
    {
        "title": "Region-based layout analysis of music score images",
        "authors": "Francisco J. Castellanos, Carlos Garrido-Munoz, Antonio Ríos-Vila, Jorge Calvo-Zaragoza",
        "description": "Novel approach for analyzing the layout of music score images using region-based techniques.",
        "venue": "Expert Systems with Applications (ESWA) 209, 118211 (2022)",
        "filename": "Music-Layout.pdf",
        "code": "",
        "year": 2022
    },
    {
        "title": "A holistic approach for image-to-graph: application to optical music recognition",
        "authors": "Carlos Garrido-Munoz, Antonio Rios-Vila, Jorge Calvo-Zaragoza",
        "description": "Comprehensive approach for converting music score images to graph representations in Optical Music Recognition.",
        "venue": "International Journal on Document Analysis and Recognition (IJDAR) 25(4) (2022)",
        "filename": "Image-to-Graph.pdf",
        "code": "",
        "year": 2022
    },
    {
        "title": "Continual learning for document image binarization",
        "authors": "Carlos Garrido-Munoz, Adrián Sánchez-Hernández, Francisco J. Castellanos, Jorge Calvo-Zaragoza",
        "description": "Study on applying continual learning techniques to document image binarization tasks.",
        "venue": "2022 26th International Conference on Pattern Recognition (ICPR) (1443-1449)",
        "filename": "Binarization-CL.pdf",
        "code": "",
        "year": 2022
    },
    {
        "title": "Retrieval of music-notation primitives via image-to-sequence approaches",
        "authors": "Carlos Garrido-Munoz, Antonio Ríos-Vila, Jorge Calvo-Zaragoza",
        "description": "Research on retrieving music notation primitives using image-to-sequence approaches.",
        "venue": "Iberian Conference on Pattern Recognition and Image Analysis 2022 (482-492)",
        "filename": "Music-Primitives.pdf",
        "code": "",
        "year": 2022
    }
] 